def noGap(myStr): #make str with no gap
     newStr=""
     for char in myStr:
         if char not in " ":
             newStr += char
          
     return newStr



print(noGap('本文考察了中国公众的结果公平感和机会公平感，检验并比较了社 会结构解释和相对剥夺解释在中国的适用性。 研 究 发 现，大 多 数 公 众 认 可 结 果公平和机会公平，且机会公平感高于结果公平感，但二者仅微弱相关。 结 果公平感由收入水平决定，机会公平感主要受教育水平影响。 外 资 和 私 营 单 位雇员比国有和集体单位雇员更具机会公平感，城市中下层就业者对结果和 机会分配均持批评态度。“个 体 相 对 剥 夺 ”而 不 是 “群 体 相 对 剥 夺 ”对 分 配 公 平感有决定性影响，结果公平感只受横向剥夺影响，而机会公平感则主要受 纵向剥夺影响。本文考察了中国公众的结果公平感和机会公平感，检验并比较了社 会结构解释和相对剥夺解释在中国的适用性。 研 究 发 现，大 多 数 公 众 认 可 结 果公平和机会公平，且机会公平感高于结果公平感，但二者仅微弱相关。 结 果公平感由收入水平决定，机会公平感主要受教育水平影响。 外 资 和 私 营 单 位雇员比国有和集体单位雇员更具机会公平感，城市中下层就业者对结果和 机会分配均持批评态度。“个 体 相 对 剥 夺 ”而 不 是 “群 体 相 对 剥 夺 ”对 分 配 公 平感有决定性影响，结果公平感只受横向剥夺影响，而机会公平感则主要受 纵向剥夺影响。'))
               

             
     
